import math


def area(r):
    '''
    Принимает радиус круга r и возвращает его площадь.

    Параметры:
        r (int/float): радиус круга

    Возвращаемое значение:
        area (float): площадь круга (math.pi * r * r)

    Пример вызова:
        >>> area(5)
        78.53981633974483
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает радиус круга r и возвращает длину его окружности (периметр).

    Параметры:
        r (int/float): радиус круга

    Возвращаемое значение:
        perimeter (float): длина окружности (2 * math.pi * r)

    Пример вызова:
        >>> perimeter(5)
        31.41592653589793
    '''
    return 2 * math.pi * r

