def area(a, b):
    '''
    Принимает стороны прямоугольника a и b и возвращает его площадь.

    Параметры:
        a (int/float): первая сторона прямоугольника
        b (int/float): вторая сторона прямоугольника

    Возвращаемое значение:
        area (int/float): площадь прямоугольника (a * b)

    Пример вызова:
        >>> area(3, 5)
        15
    '''
    return a * b

def perimeter(a, b):
   '''
    Принимает стороны прямоугольника a и b и возвращает его периметр.

    Параметры:
        a (int/float): первая сторона прямоугольника
        b (int/float): вторая сторона прямоугольника

    Возвращаемое значение:
        perimeter (int/float): периметр прямоугольника (2 * (a + b))

    Пример вызова:
        >>> perimeter(3, 5)
        16
    '''
   return 2 * (a + b)