
def area(a):
    '''
    Принимает сторону квадрата a и возвращает его площадь.

    Параметры:
        a (int/float): сторона квадрата

    Возвращаемое значение:
        area (int/float): площадь квадрата (a * a)

    Пример вызова:
        >>> area(4)
        16
    ''' 
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата a и возвращает его периметр.

    Параметры:
        a (int/float): сторона квадрата

    Возвращаемое значение:
        perimeter (int/float): периметр квадрата (4 * a)

    Пример вызова:
        >>> perimeter(4)
        16
    '''
    return 4 * a
