def area(a, h): 
    '''
    Принимает сторону a и высоту h, опущенную на эту сторону, и возвращает площадь треугольника.

    Параметры:
        a (int/float): сторона треугольника
        h (int/float): высота треугольника

    Возвращаемое значение:
        area (float): площадь треугольника (a * h / 2)

    Пример вызова:
        >>> area(4, 3)
        6.0
    '''
    return a * h / 2 
def perimeter(a, b, c): 
    '''
    Принимает три стороны треугольника a, b, c и возвращает его периметр.

    Параметры:
        a (int/float): первая сторона
        b (int/float): вторая сторона
        c (int/float): третья сторона

    Возвращаемое значение:
        perimeter (int/float): периметр треугольника (a + b + c)

    Пример вызова:
        >>> perimeter(3, 4, 5)
        12
    '''
    return a + b + c 
